# Property Performance Analysis

## Outline

- [Introduction](#Introduction)
- [Importing required libraries](#Importing-required-libraries)
- [Data loading & initial view](#Data-loading-&-initial-view)
- [Data Cleaning and Preparation](#Data-Cleaning-and-Preparation)
- [Save clean datasets](#Save-clean-datasets)

## Introduction

A real estate company wants to assess the performance of  their properties which are spread across various locations in Nairobi. The analysis focuses on rent performance, occupancy, and arrears using data from the company’s key operational tables — locations, properties, units, tenants, and leases.

In this notebook, I begin the process by exploring the data for quality issues and performing the neccessary cleaning and transformations to prepare it for analysis.

## Importing required libraries

In [33]:
import pandas as pd
from datetime import datetime, date

## Data loading & initial view

I loaded five CSV files, each containing records for `locations`, `properties`, `units`, `tenants`, and `leases` respectively. Initially, all files except leases.csv did not load into clean rows and columns. 

Upon inspecting the files in a text editor, I discovered that their separator was a semicolon `;` instead of a comma. I therefore specified `sep=';'` in the pd.read_csv() function for those files to ensure they were read correctly.

In [34]:
locations_df = pd.read_csv("Data/locations.csv", sep=';')
locations_df.head(10)

   id         name
0   1  Nairobi CBD
1   2    Westlands
2   3     Kilimani

In [35]:
properties_df = pd.read_csv("Data/properties.csv", sep=';')
properties_df.head(10)

   id                     name  location_id
0   1              NSSF Towers            1
1   2             Delta Corner            2
2   3  The Junction Residences            3
3   4          Riverside Court            2
4   5            Kimathi House            1

In [36]:
units_df = pd.read_csv("Data/units.csv", sep=';')
units_df.head(10)

   id  property_id   name   size
0   1            1  A-101   75.0
1   2            1  A-102   80.5
2   3            1  B-201   65.0
3   4            1  B-202   92.0
4   5            1  C-301  120.0
5   6            2  DC-1A   55.0
6   7            2  DC-1B   60.0
7   8            2  DC-2A   85.0
8   9            2  DC-2B  100.0
9  10            2  DC-3A   73.5

In [37]:
tenants_df = pd.read_csv("Data/tenants.csv", sep=';')
tenants_df.head(10)

   id            name                       email
0   1    Amina Mwangi    amina.mwangi@example.com
1   2    Brian Otieno    brian.otieno@example.com
2   3   Carol Wanjiru   carol.wanjiru@example.com
3   4    David Kiptoo    david.kiptoo@example.com
4   5    Eunice Njeri    eunice.njeri@example.com
5   6    Farah Hassan    farah.hassan@example.com
6   7     George Ouma     george.ouma@example.com
7   8  Hannah Achieng  hannah.achieng@example.com
8   9     Ian Wachira     ian.wachira@example.com
9  10      Joy Wambui      joy.wambui@example.com

In [38]:
leases_df = pd.read_csv("Data/leases.csv")
leases_df

    id  unit_id  tenant_id  rent_per_month  arrears  start_date    end_date
0    1        1          1           45000        0  01/01/2024         NaN
1    2        2          2           55000     5000  01/11/2023  31/10/2024
2    3        3          3           65000    -2000  01/02/2024         NaN
3    4        4          4          -30000     1000  01/03/2024         NaN
4    5        5          3           70000        0  01/02/2025  31/12/2025
5    6        6          5           40000     8000  15/06/2024  14/06/2025
6    7        7          6           52000        0  01/08/2024  31/07/2024
7    8        8          7           38000    12000  01/09/2023         NaN
8    9        9          8           60000        0  01/01/2025         NaN
9   10       10          2          -45000     1000  01/02/2024  31/12/2024
10  11       11          9           31000        0  01/05/2023  30/04/2024
11  12       12         10           47000     3000  01/10/2024  30/09/2025

The tables are related to each other given the presence of foreign keys.

## Data Quality Issues

I examined the datasets for potential data quality issues. I created a reusable function to perform basic data checks on each DataFrame. The function summarizes data types, identifies missing values and duplicates, and provides descriptive statistics for numeric columns.

In [39]:
def data_check(df):
# Perfom certain quality checks on each dataframe
    
    print("Data types and non-null counts:")
    print(df.info())
    print("\n" + "="*60 + "\n")

    print("Missing values per column:")
    print(df.isnull().sum())
    print("\n" + "="*60 + "\n")

    print(f"Number of duplicated rows: {df.duplicated().sum()}")
    print("\n" + "="*60 + "\n")

    print("Summary statistics for numeric columns:")
    print(df.describe())
    print("\n" + "="*60 + "\n")

#### a) Locations

In [40]:
data_check(locations_df)

Data types and non-null counts:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      3 non-null      int64
 1   name    3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes
None

============================================================

Missing values per column:
id      0
name    0
dtype: int64

============================================================

Number of duplicated rows: 0

============================================================

Summary statistics for numeric columns:
        id
count  3.0
mean   2.0
std    1.0
min    1.0
25%    1.5
50%    2.0
75%    2.5
max    3.0

============================================================

#### b) Properties

In [41]:
data_check(properties_df)

Data types and non-null counts:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   name         5 non-null      object
 2   location_id  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes
None

============================================================

Missing values per column:
id             0
name           0
location_id    0
dtype: int64

============================================================

Number of duplicated rows: 0

============================================================

Summary statistics for numeric columns:
             id  location_id
count  5.000000      5.00000
mean   3.000000      1.80000
std    1.581139      0.83666
min    1.000000      1.00000
25%    2.000000      1.00000
50%    3.000000      2.00000
75%    4.000000      2.00000
max    5.000000      3.00000

============================================================

#### c) Units

In [42]:
data_check(units_df)

Data types and non-null counts:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   property_id  20 non-null     int64
 2   name         20 non-null     object
 3   size         20 non-null     float64
dtypes: float64(1), int64(2), object(1)
memory usage: 772.0+ bytes
None

============================================================

Missing values per column:
id             0
property_id    0
name           0
size           0
dtype: int64

============================================================

Number of duplicated rows: 0

============================================================

Summary statistics for numeric columns:
             id  property_id        size
count  20.00000     20.00000   20.000000
mean   10.50000      2.70000   71.975000
std     5.91608      1.41793   19.028701
min     1.00000      1.00000   40.000000
25%     5.75000      1.75000   59.500000
50%    10.50000      2.50000   69.000000
75%    15.25000      4.00000   81.625000
max    20.00000      5.00000  120.000000

============================================================

#### d) Tenants

In [43]:
data_check(tenants_df)

Data types and non-null counts:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      15 non-null     int64
 1   name    15 non-null     object
 2   email   14 non-null     object
dtypes: int64(1), object(2)
memory usage: 492.0+ bytes
None

============================================================

Missing values per column:
id       0
name     0
email    1
dtype: int64

============================================================

Number of duplicated rows: 0

============================================================

Summary statistics for numeric columns:
              id
count  15.000000
mean    8.000000
std     4.472136
min     1.000000
25%     4.500000
50%     8.000000
75%    11.500000
max    15.000000

============================================================

#### e) Leases

In [44]:
data_check(leases_df)

Data types and non-null counts:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              12 non-null     int64
 1   unit_id         12 non-null     int64
 2   tenant_id       12 non-null     int64
 3   rent_per_month  12 non-null     int64
 4   arrears         12 non-null     int64
 5   start_date      12 non-null     object
 6   end_date        7 non-null      object
dtypes: int64(5), object(2)
memory usage: 804.0+ bytes
None

============================================================

Missing values per column:
id                0
unit_id           0
tenant_id         0
rent_per_month    0
arrears           0
start_date        0
end_date          5
dtype: int64

============================================================

Number of duplicated rows: 0

============================================================

Summary statistics for numeric columns:
              id    unit_id  tenant_id  rent_per_month       arrears
count  12.000000  12.000000   12.00000       12.000000     12.000000
mean    6.500000   6.500000    5.00000    35666.666667   2333.333333
std     3.605551   3.605551    2.98481    36121.847666   4075.053448
min     1.000000   1.000000    1.00000   -45000.000000  -2000.000000
25%     3.750000   3.750000    2.75000    36250.000000      0.000000
50%     6.500000   6.500000    4.50000    46000.000000    500.000000
75%     9.250000   9.250000    7.25000    56250.000000   3500.000000
max    12.000000  12.000000   10.00000    70000.000000  12000.000000

============================================================

### Summary

Based on the above output as well as visual inspection, I take note of the following data issues:

    • Locations, Properties, and Units
These datasets are clean, with no missing or duplicate values. Data types appear appropriate, and numerical columns fall within reasonable ranges.
	
    • Tenants
One missing value was detected in the email column. This could represent incomplete contact information that may need to be filled or flagged, depending on how tenant communications are handled.
	
    • Leases
Several issues were identified:
- The date columns are not in the correct datetime format
- Missing values in the end_date column: I need to consult whether this is possibly due to ongoing leases or incomplete data entry.
- Negative values in rent_per_month: This indicates data entry or system errors. I would need to confirm if it's only a signage error or the entire value is erranous.
- Negative values in arrears — may represent overpayments, which should be confirmed.
- Some lease records have end_date earlier than start_date, suggesting either incorrect entry or reversed dates.

## Data Cleaning and Preparation

After reviewing the datasets and consulting on the identified data quality issues, I developed the following approaches to clean the data:

### a) Convert the date columns into datetime format

This will allow for date operations.

In [45]:
# Convert dates are in datetime format
leases_df['start_date'] = pd.to_datetime(leases_df['start_date'], format='%d/%m/%Y', errors='coerce')
leases_df['end_date'] = pd.to_datetime(leases_df['end_date'], format='%d/%m/%Y', errors='coerce')

In [46]:
# Preview
leases_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              12 non-null     int64
 1   unit_id         12 non-null     int64
 2   tenant_id       12 non-null     int64
 3   rent_per_month  12 non-null     int64
 4   arrears         12 non-null     int64
 5   start_date      12 non-null     datetime64[ns]
 6   end_date        7 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(5)
memory usage: 804.0 bytes

### b) Missing end_date values: 

These will be treated as ongoing leases upto today. Therefore, I will replace the `Null` date values with the current date.

In [47]:
# Define today's date
today = pd.to_datetime(date.today())

# Replace missing end_date values with today's date
leases_df['end_date'] = leases_df['end_date'].fillna(today)

In [48]:
leases_df.head(5)

   id  unit_id  tenant_id  rent_per_month  arrears start_date   end_date
0   1        1          1           45000        0 2024-01-01 2025-11-03
1   2        2          2           55000     5000 2023-11-01 2024-10-31
2   3        3          3           65000    -2000 2024-02-01 2025-11-03
3   4        4          4          -30000     1000 2024-03-01 2025-11-03
4   5        5          3           70000        0 2025-02-01 2025-12-31

### c) Create `lease_duration_months` column

This column will store duration in months between start_date and end_date (or today for ongoing leases).

In [49]:
# Extract the year, subtract to get years apart then multiply by 12 to get months
# Extract the month, subtract to get months apart
# Add them for total months
leases_df['lease_duration_months'] = ((leases_df['end_date'].dt.year - leases_df['start_date'].dt.year)*12)+(leases_df['end_date'].dt.month - leases_df['start_date'].dt.month)

In [50]:
# Preview
leases_df.head(5)

,id,unit_id,tenant_id,rent_per_month,arrears,start_date,end_date,lease_duration_months
0,1,1,1,45000,0,2024-01-01,2025-11-03,22
1,2,2,2,55000,5000,2023-11-01,2024-10-31,11
2,3,3,3,65000,-2000,2024-02-01,2025-11-03,21
3,4,4,4,-30000,1000,2024-03-01,2025-11-03,20
4,5,5,3,70000,0,2025-02-01,2025-12-31,10

### d) Create `lease_status` column

This column will categorizing leases as ongoing, expired, or invalid.

In [51]:
# Function to apply to df that assigns value to new column based on existing columns
def lease_status(row):
    if row["lease_duration_months"] < 1:
        return "invalid"
    elif row["end_date"] >= today:
        return "ongoing"
    else:
        return "expired"

In [52]:
# Apply function above to create new column
leases_df['lease_status'] = leases_df.apply(lease_status, axis=1)

In [53]:
# Preview
leases_df.head(5)

,id,unit_id,tenant_id,rent_per_month,arrears,start_date,end_date,lease_duration_months,lease_status
0,1,1,1,45000,0,2024-01-01,2025-11-03,22,ongoing
1,2,2,2,55000,5000,2023-11-01,2024-10-31,11,expired
2,3,3,3,65000,-2000,2024-02-01,2025-11-03,21,ongoing
3,4,4,4,-30000,1000,2024-03-01,2025-11-03,20,ongoing
4,5,5,3,70000,0,2025-02-01,2025-12-31,10,ongoing

### Create `valid_lease` column

Date inconsistencies (where the end_date is earlier than the start_date) will be flagged as invalid leases for further review rather than removed immediately.

In [54]:
# Flag as 0 0r 1 depending on lease_status colum value
leases_df['valid_lease'] = [0 if status == "invalid" else 1 for status in leases_df["lease_status"]]

In [55]:
# Preview
leases_df.head(5)

,id,unit_id,tenant_id,rent_per_month,arrears,start_date,end_date,lease_duration_months,lease_status,valid_lease
0,1,1,1,45000,0,2024-01-01,2025-11-03,22,ongoing,1
1,2,2,2,55000,5000,2023-11-01,2024-10-31,11,expired,1
2,3,3,3,65000,-2000,2024-02-01,2025-11-03,21,ongoing,1
3,4,4,4,-30000,1000,2024-03-01,2025-11-03,20,ongoing,1
4,5,5,3,70000,0,2025-02-01,2025-12-31,10,ongoing,1

### Correct negative rent values

Negative rent_per_month values were identified as sign errors and will be converted to positive values.

In [56]:
# Apply absolute value to each value in the rent_per_month column
leases_df["rent_per_month"] = leases_df["rent_per_month"].apply(abs)

In [57]:
# Preview
leases_df.head(5)

,id,unit_id,tenant_id,rent_per_month,arrears,start_date,end_date,lease_duration_months,lease_status,valid_lease
0,1,1,1,45000,0,2024-01-01,2025-11-03,22,ongoing,1
1,2,2,2,55000,5000,2023-11-01,2024-10-31,11,expired,1
2,3,3,3,65000,-2000,2024-02-01,2025-11-03,21,ongoing,1
3,4,4,4,30000,1000,2024-03-01,2025-11-03,20,ongoing,1
4,5,5,3,70000,0,2025-02-01,2025-12-31,10,ongoing,1

### Create `annual_rent` column

This is computed as `rent_per_month * 12`.

In [58]:
leases_df["annual_rent"] = leases_df["rent_per_month"] * 12

In [59]:
# Preview
leases_df.head(5)

,id,unit_id,tenant_id,rent_per_month,arrears,start_date,end_date,lease_duration_months,lease_status,valid_lease,annual_rent
0,1,1,1,45000,0,2024-01-01,2025-11-03,22,ongoing,1,540000
1,2,2,2,55000,5000,2023-11-01,2024-10-31,11,expired,1,660000
2,3,3,3,65000,-2000,2024-02-01,2025-11-03,21,ongoing,1,780000
3,4,4,4,30000,1000,2024-03-01,2025-11-03,20,ongoing,1,360000
4,5,5,3,70000,0,2025-02-01,2025-12-31,10,ongoing,1,840000

### Standardize location names

Location names will be standardized to Proper Case for consistency.

In [60]:
# Location names to proper case
locations_df["name"] = locations_df["name"].str.title()

In [61]:
# Preview
locations_df

   id         name
0   1  Nairobi Cbd
1   2    Westlands
2   3     Kilimani

## Save clean datasets

In [62]:
leases_df.to_csv("Data/leases_clean.csv", index=False)

In [63]:
locations_df.to_csv("Data/locations_clean.csv", index=False)